{
  "books": {
    "0": {
      "title": "The Hitchhiker's Guide to the Galaxy",
      "author": "Douglas Adams",
      "summary": "Seconds before Earth is demolished to make way for a galactic freeway, Arthur Dent is plucked off the planet by his friend Ford Prefect, a researcher for the revised edition of The Hitchhiker’s Guide to the Galaxy who, for the last fifteen years, has been posing as an out-of-work actor. Together, this dynamic pair began a journey through space aided by a galaxyful of fellow travelers: Zaphod Beeblebrox, the two-headed, three-armed, ex-hippie and totally out-to-lunch president of the galaxy; Trillian (formerly Tricia McMillan), Zaphod’s girlfriend, whom Arthur tried to pick up at a cocktail party once upon a time zone; Marvin, a paranoid, brilliant, and chronically depressed robot; and Veet Voojagig, a former graduate student obsessed with the disappearance of all the ballpoint pens he’s bought over the years.Where are these pens? Why are we born? Why do we die? For all the answers, stick your thumb to the stars! ",
      "coverIMG": "https://images.gr-assets.com/books/1388282444l/386162.jpg",
      "shelf": "read",
      "rating": 4
    },
    "1": {
      "title": "The Restaurant at the End of the Universe",
      "author": "Douglas Adams",
      "summary": "Facing annihilation at the hands of the warlike Vogons is a curious time to have a craving for tea. It could only happen to the cosmically displaced Arthur Dent and his curious comrades in arms as they hurtle across space powered by pure improbabilityband desperately in search of a place to eat. Among Arthur's motley shipmates are Ford Prefect, a longtime friend and expert contributor to the Hitchhiker's Guide to the Galaxy; Zaphod Beeblebrox, the three-armed, two-headed ex-president of the galaxy; Tricia McMillan, a fellow Earth refugee who's gone native (her name is Trillian now); and Marvin, the moody android who suffers nothing and no one very gladly. Their destination? The ultimate hot spot for an evening of apocalyptic entertainment and fine dining, where the food (literally) speaks for itself. Will they make it? The answer: hard to say. But bear in mind that the Hitchhiker's Guide deleted the term 'Future Perfect' from its pages, since it was discovered not to be! 'What's such fun is how amusing the galaxy looks through Adams' sardonically silly eyes.'",
      "coverIMG": "https://images.gr-assets.com/books/1390234660l/8695.jpg",
      "shelf": "read",
      "rating": 4
    },
    "2": {
      "title": "Life, the Universe and Everything",
      "author": "Douglas Adams",
      "summary": "The unhappy inhabitants of planet Krikkit are sick of looking at the night sky above their heads–so they plan to destroy it. The universe, that is. Now only five individuals stand between the killer robots of Krikkit and their goal of total annihilation. They are Arthur Dent, a mild-mannered space and time traveler who tries to learn how to fly by throwing himself at the ground and missing; Ford Prefect, his best friend, who decides to go insane to see if he likes it; Slartibartfast, the indomitable vice president of the Campaign for Real Time, who travels in a ship powered by irrational behavior; Zaphod Beeblebrox, the two-headed, three-armed ex-president of the galazy; and Trillian, the sexy space cadet who is torn between a persistent Thunder God and a very depressed Beeblebrox. How will it all end? Will it end? Only this stalwart crew knows as they try to avert 'universal' Armageddon and save life as we know it–and don’t know it!",
      "coverIMG": "https://images.gr-assets.com/books/1333577589l/8694.jpg",
      "shelf": "read",
      "rating": 4
    },
    "3": {
      "title": "So Long, and Thanks for All the Fish",
      "author": "Douglas Adams",
      "summary": "Back on Earth with nothing more to show for his long, strange trip through time and space than a ratty towel and a plastic shopping bag, Arthur Dent is ready to believe that the past eight years were all just a figment of his stressed-out imagination. But a gift-wrapped fishbowl with a cryptic inscription, the mysterious disappearance of Earth's dolphins, and the discovery of his battered copy of The Hitchhiker's Guide to the Galaxy all conspire to give Arthur the sneaking suspicion that something otherworldly is indeed going on... God only knows what it all means. And fortunately, He left behind a Final Message of explanation. But since it's light-years away from Earth, on a star surrounded by souvenir booths, finding out what it is will mean hitching a ride to the far reaches of space aboard a UFO with a giant robot. But what else is new?",
      "coverIMG": "https://images.gr-assets.com/books/1327873354l/6091075.jpg",
      "shelf": "read",
      "rating": 4
    },
    "4": {
      "title": "The Long Dark Tea-Time of the Soul",
      "author": "Douglas Adams",
      "summary": "When a passenger check-in desk at London's Heathrow Airport disappears in a ball of orange flame, the explosion is deemed an act of God. But which god, wonders holistic detective Dirk Gently? What god would be hanging around Heathrow trying to catch the 3:37 to Oslo? And what has this to do with Dirk's latest--and late-- client, found only this morning with his head revolving atop the hit record 'Hot Potato'? Amid the hostile attentions of a stray eagle and the trauma of a very dirty refrigerator, super-sleuth Dirk Gently will once again solve the mysteries of the universe",
      "coverIMG": "https://images.gr-assets.com/books/1388257271l/357.jpg",
      "shelf": "",
      "rating": 0
    },
    "5": {
      "title": "Getting Things Done: the art of stress-free productivity",
      "author": "David Allen",
      "summary": "In today's world, yesterday's methods just don't work. In Getting Things Done, veteran coach and management consultant David Allen shares the breakthrough methods for stress-free performance that he has introduced to tens of thousands of people across the country. Allen's premise is simple: our productivity is directly proportional to our ability to relax. Only when our minds are clear and our thoughts are organized can we achieve effective productivity and unleash our creative potential.",
      "coverIMG": "https://images.gr-assets.com/books/1312474060l/1633.jpg",
      "shelf": "current",
      "rating": 5
    },
    "6": {
      "title": "Flowers in the Attic",
      "author": "V.C. Andrews",
      "summary": "It wasn't that she didn't love her children. She did. But there was a fortune at stake--a fortune that would assure their later happiness if she could keep the children a secret from her dying father. So she and her mother hid her darlings away in an unused attic. Just for a little while. But the brutal days swelled into agonizing years. Now Cathy, Chris, and the twins wait in their cramped and helpless world, stirred by adult dreams, adult desires, served a meager sustenance by an angry, superstitious grandmother who knows that the Devil works in dark and devious ways. Sometimes he sends children to do his work--children who--one by one--must be destroyed....",
      "coverIMG": "https://images.gr-assets.com/books/1327880853l/43448.jpg",
      "shelf": "read",
      "rating": 4
    },
    "7": {
      "title": "Petals on the Wind",
      "author": "V.C. Andrews",
      "summary": "For Carrie, Chris and Cathy, the attic was a dark horror that would not leave their minds, even while they built bright, promising new lives. Of course mother had to pretend they didn't exist. And Grandmother was convinced they had the devil in them. But that wasn't their fault. Was it? Cathy knew what to do. She now had the powers she had learned from her beautiful mother. She knew it in the way her brother still yearned for her, in the way her guardian touched her, in the way all men looked at her. She knew it was time to put what she knew to the test. To show her mother and grandmother that the pain and terror of the attic could not be forgotten",
      "coverIMG": "https://images.gr-assets.com/books/1388176436l/226709.jpg",
      "shelf": "read",
      "rating": 2
    },
    "8": {
      "title": "A Spell for Chameleon",
      "author": "Piers Anthony",
      "summary": "Xanth was the enchanted land where magic ruled - where every citizen had a special spell only he could cast. It was a land of centaurs and dragons and basilisks. For Bink of North Village, however, Xanth was no fairy tale. He alone had no magic. And unless he got some - and got some fast! - he would be exiled. Forever! But the Good Magician Humfrey was convinced that Bink did indeed have magic. In fact, both Beauregard the genie and the magic wall chart insisted that Bink had magic. Magic as powerful as any possessed by the King or by Good Magician Humfrey - or even by the Evil Magician Trent Be that as it may, no one could fathom the nature of Bink's very special magic. Bink was in despair. This was even worse than having no magic at all..and he would still be exiled!",
      "coverIMG": "https://images.gr-assets.com/books/1476435403l/76664.jpg",
      "shelf": "read",
      "rating": 2
    },
    "9": {
      "title": "The Source of Magic",
      "author": "Piers Anthony",
      "summary": "Ordered by King Trent to determine the source of Xanth's magic, Bink and his companions were harried by an unseen enemy determined to thwart them. When even their protector turned against them, Bink still managed to reach his goal and carry out the King's orders...but the king did not expect Bink's next act--to destroy utterly the magic of Xanth!",
      "coverIMG": "https://images.gr-assets.com/books/1179544290l/15447.jpg",
      "shelf": "read",
      "rating": 3
    },
    "10": {
      "title": "Peter Pan",
      "author": "J.M. Barrie",
      "summary": "Peter Pan, the book based on J.M. Barrie's famous play, is filled with unforgettable characters: Peter Pan, the boy who would not grow up; the fairy, Tinker Bell; the evil pirate, Captain Hook; and the three children--Wendy, John, and Michael--who fly off with Peter Pan to Neverland, where they meet Indians and pirates and a crocodile that ticks.",
      "coverIMG": "https://images.gr-assets.com/books/1337714526l/34268.jpg",
      "shelf": "read",
      "rating": 5
    },
    "11": {
      "title": "The Looking Glass Wars",
      "author": "Frank Beddor",
      "summary": "When Alyss Heart, newly orphaned heir to the Wonderland throne, flees through the Pool of Tears to escape her murderous Aunt Redd, she finds herself lost and alone in Victorian London. Befriended by an aspiring author named Lewis Carrol, Alyss tells the violent, heartbreaking story of her young life. Alyss trusts this author to tell the truth so that someone, somewhere will find her and bring her home. But he gets the story all wrong. He even spells her name incorrectly! Fortunately, Royal Bodyguard Hatter Madigan knows all too well the awful truth of Alyss' story - and he's searching every corner of our world to find the lost princess and return her to Wonderland, to battle Redd for her rightful place as the Queen of Hearts. The Looking Glass Wars unabashedly challenges our Wonderland assumptions of mad tea parties, grinning Cheshire cats, and a curious little blond girl to reveal an epic battle in the endless war for Imagination.",
      "coverIMG": "https://images.gr-assets.com/books/1354845928l/44170.jpg",
      "shelf": "read",
      "rating": 3
    },
    "12": {
      "title": "Seeing Redd",
      "author": "Frank Beddor",
      "summary": "Alyss of Wonderland's rule has only just begun, and already those who prefer chaos to peace are threatening to destroy everything worth imagining. Trailed by newly appointed royal bodyguard Homburg Molly, Alyss is doing her best to keep pace with the non-stop demands of being queen while attempting to evade Molly for a few private moments with Dodge. Alyss' life is a challenging mix of duty, love, and tough decisions, and then a series of phantom sightings set fire to an urban myth of Her Imperial Viciousness' return and have everyone... seeing Redd. Has Redd somehow freed herself and her chief assassin, The Cat, from the confines of the Heart Crystal? If not, then who has resurrected Redd's brutal foot soldiers the Glass Eyes and set them loose to attack Wonderland on all sides? Battles rage, looking glasses explode, and the Alyssians once again unite to defend White Imagination.",
      "coverIMG": "https://images.gr-assets.com/books/1354846350l/289695.jpg",
      "shelf": "read",
      "rating": 3
    },
    "13": {
      "title": "ArchEnemy",
      "author": "Frank Beddor",
      "summary": "The power of imagination has been lost! Now it's all about the artillery as AD52s, crystal shooters, spikejack tumblers, and orb cannons are unleashed in a war of weapons and brute force. As Alyss searches wildly for the solution to the disaster that has engulfed her queendom, Arch declares himself King of Wonderland. The moment is desperate enough for Alyss to travel back to London for answers, where Arch's assassins are threatening Alice Liddell and her family. But after coming to the Liddells' assistance, Alyss discovers herself trapped in a conundrum of evaporating puddles. The shimmering portals that exist to transport her home through the Pool of Tears are disappearing! What is happening in Wonderland? Deep within the Valley of Mushroom the Caterpillar Oracles issue this prophecy: 'Action shall be taken to ensure the safety of the Heart Crystal. For Everqueen.' But who is Everqueen? As the metamorphosis of Wonderland unfolds, enemies become allies, bitter rivals face off, and Queen Alyss and Redd Heart must both confront their pasts.",
      "coverIMG": "https://images.gr-assets.com/books/1304050233l/6178354.jpg",
      "shelf": "read",
      "rating": 3
    },
    "14": {
      "title": "Alice I Have Been",
      "author": "Melanie Benjamin",
      "summary": "Part love story, part literary mystery, Melanie Benjamin’s spellbinding historical novel leads readers on an unforgettable journey down the rabbit hole, to tell the story of a woman whose own life became the stuff of legend. Her name is Alice Liddell Hargreaves, but to the world she’ll always be known simply as 'Alice,' the girl who followed the White Rabbit into a wonderland of Mad Hatters, Queens of Hearts, and Cheshire Cats. Now, nearing her eighty-first birthday, she looks back on a life of intense passion, great privilege, and greater tragedy. First as a young woman, then as a wife, mother, and widow, she’ll experience adventures the likes of which not even her fictional counterpart could have imagined. Yet from glittering balls and royal romances to a world plunged into war, she’ll always be the same determined, undaunted Alice who, at ten years old, urged a shy, stuttering Oxford professor to write down one of his fanciful stories, thus changing her life forever.",
      "coverIMG": "https://images.gr-assets.com/books/1362466521l/7994902.jpg",
      "shelf": "want",
      "rating": 0
    },
    "15": {
      "title": "Flatland",
      "author": "Edwin A. Abbott",
      "summary": "This masterpiece of science (and mathematical) fiction is a delightfully unique and highly entertaining satire that has charmed readers for more than 100 years. The work of English clergyman, educator and Shakespearean scholar Edwin A. Abbott (1838-1926), it describes the journeys of A. Square, a mathematician and resident of the two-dimensional Flatland, where women-thin, straight lines-are the lowliest of shapes, and where men may have any number of sides, depending on their social status. Through strange occurrences that bring him into contact with a host of geometric forms, Square has adventures in Spaceland (three dimensions), Lineland (one dimension) and Pointland (no dimensions) and ultimately entertains thoughts of visiting a land of four dimensions—a revolutionary idea for which he is returned to his two-dimensional world. Charmingly illustrated by the author, Flatland is not only fascinating reading, it is still a first-rate fictional introduction to the concept of the multiple dimensions of space.",
      "coverIMG": "https://images.gr-assets.com/books/1435435775l/433567.jpg",
      "shelf": "",
      "rating": 0
    },
    "16": {
      "title": "People's History of the Peculiar",
      "author": "Nick Belardes",
      "summary": "Did you know that Thomas Jefferson’s grandson was an ax murderer? Do you delight knowing that some dinosaurs were as teeny tiny as hens? Wonder what it’s like to live in Hell Town at the End of the World? How about an ailment so surreal it’s named after Alice in Wonderland? In A People's History of the Peculiar, historian Nick Belardes has dug into the raw source material found in historical archives, scientific studies, and libraries the world over to find facts, lists, definitions, and astonishing information guaranteed to provide readers with the best cocktail conversation topics for many years to come! Also found here are first-person interviews with people who can explain the unexplained, from the permanently puzzling Mothman conspiracy to secret Star Wars Jedi religious cults and the charmingly eccentric reason why British aerospace engineers sent teddy bears floating out into space. These real-world facts are outlandish enough to sharpen the brain and occupy readers’ minds for hours of entertainment.",
      "coverIMG": "https://images.gr-assets.com/books/1392233067l/18249439.jpg",
      "shelf": "",
      "rating": 0
    },
    "17": {
      "title": "The Martian Chronicles",
      "author": "Ray Bradbury",
      "summary": "The strange and wonderful tale of man’s experiences on Mars, filled with intense images and astonishing visions. Now part of the Voyager Classics collection. The Martian Chronicles tells the story of humanity’s repeated attempts to colonize the red planet. The first men were few. Most succumbed to a disease they called the Great Loneliness when they saw their home planet dwindle to the size of a fist. They felt they had never been born. Those few that survived found no welcome on Mars. The shape-changing Martians thought they were native lunatics and duly locked them up. But more rockets arrived from Earth, and more, piercing the hallucinations projected by the Martians. People brought their old prejudices with them – and their desires and fantasies, tainted dreams. These were soon inhabited by the strange native beings, with their caged flowers and birds of flame.",
      "coverIMG": "https://images.gr-assets.com/books/1374049948l/76778.jpg",
      "shelf": "",
      "rating": 0
    },
    "18": {
      "title": "CSS Animations and Transitions for the Modern Web",
      "author": "Steven Bradley",
      "summary": "Modern websites use a variety of animated effects not only to improve usability but also to delight and surprise users. Some of these effects require complex scripting or programming skills, but many are within the grasp of designers who are already familiar with CSS and HTML. CSS Animations and Transitions for the Modern Web shows designers how to add movement to web pages over time using CSS3 style definitions. ",
      "coverIMG": "https://images.gr-assets.com/books/1414347568l/22251149.jpg",
      "shelf": "",
      "rating": 0
    },
    "19": {
      "title": "Welcome to the Goddamn Ice Cube",
      "author": "Blair Braverman",
      "summary": "A rich and revelatory memoir of a young woman confronting her fears and finding home in the North. Blair Braverman fell in love with the North at an early age: by the time she was 19, she had left her home in California, moved to Norway to learn how to drive sled dogs, and worked as a tour guide on a glacier in Alaska. Determined to make a life for herself in the North, she slowly developed the strength and resilience the landscape demanded of her.  By turns funny and sobering, bold and tender, Welcome to the Goddamn Ice Cube charts Blair’s endeavor to become a “tough girl”—someone who courts danger in an attempt to become fearless. As she ventures into a ruthless arctic landscape, Blair faces down physical exhaustion—being buried alive in an ice cave, and driving a dogsled across the tundra through a white-out blizzard in order to avoid corrupt police—and grapples with both love and violence as she negotiates the complex demands of being a young woman in a man's land. Brilliantly original and bracingly honest, Welcome to the Goddamn Ice Cube captures the triumphs and the perils of the journey to self-discovery and independence in a landscape that is as beautiful as it is unforgiving.",
      "coverIMG": "https://images.gr-assets.com/books/1458594651l/25773791.jpg",
      "shelf": "",
      "rating": 0
    },
    "20": {
      "title": "Storm Front",
      "author": "Jim Butcher",
      "summary": "Harry Dresden is the best at what he does. Well, technically, he's the only at what he does. So when the Chicago P.D. has a case that transcends mortal creativity or capability, they come to him for answers. For the 'everyday' world is actually full of strange and magical things—and most don't play well with humans. That's where Harry comes in. Takes a wizard to catch a—well, whatever. There's just one problem. Business, to put it mildly, stinks. So when the police bring him in to consult on a grisly double murder committed with black magic, Harry's seeing dollar signs. But where there's black magic, there's a black mage behind it. And now that mage knows Harry's name. And that's when things start to get interesting.",
      "coverIMG": "https://images.gr-assets.com/books/1419456275l/47212.jpg",
      "shelf": "current",
      "rating": 0
    }
  }
}